static/presentations/2019-05-07/index.org
#+REVEAL_THEME: white
#+TITLE: Intro
#+AUTHOR: Edmund Miller
#+OPTIONS: reveal_title_slide:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_HLEVEL: 1
* eRNA Kinetics from INFB1 induction
* Who am I
- Plano, TX
- [[https://github.com/Emiller88][GitHub]]
- Undergraduate Molecular Biology '15-'18
- Masters Biotechnology '18-'19
- Joined Functional Genomics group in July '15
- Moved to Dry Lab Summer '17
- Software Developer for Olypsis Technologies since May '18
** What I am looking to get out of this
** 
:PROPERTIES:
:reveal_background: img/biovenn.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
** Things I can bring to the table
- Wet Lab
- Linux
- Emacs
- Git
- Devops & CI/CD
- Docker
- Snakemake
* Reproducible Research
** Creating a Workflow
*** Emacs
- Evil Keybinding
- Magit
- Dired
- Tramp
- Org-mode
- Email
- RSS
*** Spacemacs
- Slow
- Difficult to Customize outside of the box
*** Doom Emacs
- Optimized
- Community
*** Org-Mode
- Slides
- TODOs
- Agenda
- Capture
- Lab-Notebook
- Babel
** Makefiles
*** 
:PROPERTIES:
:reveal_background: img/data.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** 
:PROPERTIES:
:reveal_background: img/data1.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** 
:PROPERTIES:
:reveal_background: img/data2.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** Example Makefile
#+BEGIN_SRC makefile
all: prot001.txt prot0002.txt prot003.txt

%.txt: ./bin/intensive_operation %.fasta
   $^ > $@

%.fasta:
    curl database.example.com/$* > $@
#+END_SRC
** Bioinformatics Pipelines
*** Toil
- Python 2.7
- UCSC
- Complex
*** Nextflow
- Java
- Barcelona Center for Genomic Regulation
- Push
- Able to script in any language
*** Snakemake
- Python 3.5
- Easy to containerize
- Pull
- Quick to use
*** 
:PROPERTIES:
:reveal_background: img/snakemake.png
:reveal_background_size: 1000px
:reveal_background_trans: slide
:END:
*** Snakemake Example
#+BEGIN_SRC snakemake
rule targets:
    input:
        "plots/dataset1.pdf",
        "plots/dataset2.pdf"

rule plot:
    input:
        "raw/{dataset}.csv"
    output:
        "plots/{dataset}.pdf"
    shell:
        "somecommand {input} {output}"
#+END_SRC
*** Snakemake R
Requires ~rpy2~
#+BEGIN_SRC snakemake
rule mapRNAseq:
    input:
        file1 = "path/to/data/file1.bam",
        file2 = "path/to/data/file2.bam"
    output:
        "path/to/qlf_table.csv"
    run:
        R("""
        bamfiles <- cbind({input.file1},{input.file2})
        {output} <- featureCounts(bamfiles, annot.inbuilt="hg19", strandspecific=2)
        ...
        ...
        write.csv(qlf_table, file={output}, quote = FALSE)
        """)
#+END_SRC
*** Snakemake R
#+begin_src snakemake
rule GM19_genes_edgeR:
    input:
        "results/2019-02-28/GM19_gene_counts.rds"
    output:
        "results/2019-03-25/GM19_rawdata_table.csv",
        "results/2019-03-25/GM19_genelen.csv",
        "results/2019-03-25/GM19_normalized.txt"
    conda:
        "../../envs/edgeR.yaml"
    threads: 4
    script:
        "../../scripts/dge.R"
#+end_src
*** Test data
#+begin_src shell
snakemake --use-conda --directory .test
#+end_src
** Organizing Bioinformatics Projects
*** 
:PROPERTIES:
:reveal_background: img/org.png
:reveal_background_size: 1200px
:reveal_background_trans: slide
:END:
* HPC Cluster
** Intro to Ganymede
- ~ganymedeadmins@utdallas.edu~
- centos 7 with OpenHPC
- http://docs.oithpc.utdallas.edu
- Access to ~normal~, ~debug~, ~genomics~, and ~GPU1~ queue
** Getting Access
- Email ~admin@ganymede~ for access and to *genomics*
- Takes around a week
- You can log in with ~ssh <NETID>@ganymede.utdallas.edu~
** Some Basic Commands
#+begin_src shell
# Info about slurm cluster
sinfo
# List enabled modules
module list
# Available module
module av
# Load anaconda
# Must be done everytime you log in
module load anaconda3
# Cancel all jobs
scancel -u <NETID>
# Check the queue
squeue -p genomics
# Submit a job
sbatch --help
#+end_src
** Installing Conda
#+begin_src shell
pip install conda
# If that doesn't work
wget https://repo.anaconda.com/miniconda/Miniconda3-latest-Linux-x86_64.sh

# Make an environment
conda create -n smk -c bioconda snakemake
conda install -c bioconda nextflow
# OR
conda create -n nf -c bioconda nextflow

# Activate your env
conda activate smk
#+end_src
