static/presentations/2019-05-07/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Intro</title>
<meta name="author" content="(Edmund Miller)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org9a0e34c">
<h2 id="org9a0e34c">eRNA Kinetics from INFB1 induction</h2>
</section>
</section>
<section>
<section id="slide-org09f57a4">
<h2 id="org09f57a4">Who am I</h2>
<ul>
<li>Plano, TX</li>
<li><a href="https://github.com/Emiller88">GitHub</a></li>
<li>Undergraduate Molecular Biology &rsquo;15-&rsquo;18</li>
<li>Masters Biotechnology &rsquo;18-&rsquo;19</li>
<li>Joined Functional Genomics group in July &rsquo;15</li>
<li>Moved to Dry Lab Summer &rsquo;17</li>
<li>Software Developer for Olypsis Technologies since May &rsquo;18</li>

</ul>
</section>
<section id="slide-org6f502cc">
<h3 id="org6f502cc">What I am looking to get out of this</h3>
</section>
<section id="slide-org6a39458" data-background="img/biovenn.png" data-background-size="800px" data-background-transition="slide">
<h3 id="org6a39458"></h3>
</section>
<section id="slide-orgede487f">
<h3 id="orgede487f">Things I can bring to the table</h3>
<ul>
<li>Wet Lab</li>
<li>Linux</li>
<li>Emacs</li>
<li>Git</li>
<li>Devops &amp; CI/CD</li>
<li>Docker</li>
<li>Snakemake</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgcda6862">
<h2 id="orgcda6862">Reproducible Research</h2>
<div class="outline-text-2" id="text-orgcda6862">
</div>
</section>
<section id="slide-org6af15b0">
<h3 id="org6af15b0">Creating a Workflow</h3>
<div class="outline-text-3" id="text-org6af15b0">
</div>
</section>
<section id="slide-org4b9db3f">
<h4 id="org4b9db3f">Emacs</h4>
<ul>
<li>Evil Keybinding</li>
<li>Magit</li>
<li>Dired</li>
<li>Tramp</li>
<li>Org-mode</li>
<li>Email</li>
<li>RSS</li>

</ul>
</section>
<section id="slide-org827a283">
<h4 id="org827a283">Spacemacs</h4>
<ul>
<li>Slow</li>
<li>Difficult to Customize outside of the box</li>

</ul>
</section>
<section id="slide-org916f227">
<h4 id="org916f227">Doom Emacs</h4>
<ul>
<li>Optimized</li>
<li>Community</li>

</ul>
</section>
<section id="slide-org33abbe9">
<h4 id="org33abbe9">Org-Mode</h4>
<ul>
<li>Slides</li>
<li>TODOs</li>
<li>Agenda</li>
<li>Capture</li>
<li>Lab-Notebook</li>
<li>Babel</li>

</ul>
</section>
<section id="slide-org78188ba">
<h3 id="org78188ba">Makefiles</h3>
<div class="outline-text-3" id="text-org78188ba">
</div>
</section>
<section id="slide-org77c7584" data-background="img/data.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org77c7584"></h4>
</section>
<section id="slide-orgf99ca9d" data-background="img/data1.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orgf99ca9d"></h4>
</section>
<section id="slide-org078f2a9" data-background="img/data2.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org078f2a9"></h4>
</section>
<section id="slide-org430f3f5">
<h4 id="org430f3f5">Example Makefile</h4>
<div class="org-src-container">

<pre  class="src src-makefile"><code trim><span style="color: #51afef;">all</span>: prot001.txt prot0002.txt prot003.txt

<span style="color: #51afef;">%.txt</span>: ./bin/intensive_operation %.fasta
   $<span style="color: #a9a1e1;">^</span> &gt; <span style="color: #51afef;">$</span><span style="color: #a9a1e1;">@</span>

<span style="color: #51afef;">%.fasta</span>:
    curl database.example.com/<span style="color: #51afef;">$</span><span style="color: #a9a1e1;">*</span> &gt; <span style="color: #51afef;">$</span><span style="color: #a9a1e1;">@</span>
</code></pre>
</div>
</section>
<section id="slide-orgec6c996">
<h3 id="orgec6c996">Bioinformatics Pipelines</h3>
<div class="outline-text-3" id="text-orgec6c996">
</div>
</section>
<section id="slide-org08888ac">
<h4 id="org08888ac">Toil</h4>
<ul>
<li>Python 2.7</li>
<li>UCSC</li>
<li>Complex</li>

</ul>
</section>
<section id="slide-org0ff984f">
<h4 id="org0ff984f">Nextflow</h4>
<ul>
<li>Java</li>
<li>Barcelona Center for Genomic Regulation</li>
<li>Push</li>
<li>Able to script in any language</li>

</ul>
</section>
<section id="slide-orgb20c4b8">
<h4 id="orgb20c4b8">Snakemake</h4>
<ul>
<li>Python 3.5</li>
<li>Easy to containerize</li>
<li>Pull</li>
<li>Quick to use</li>

</ul>
</section>
<section id="slide-orgc0bfa8f" data-background="img/snakemake.png" data-background-size="1000px" data-background-transition="slide">
<h4 id="orgc0bfa8f"></h4>
</section>
<section id="slide-orgf26b3af">
<h4 id="orgf26b3af">Snakemake Example</h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">targets</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"plots/dataset1.pdf"</span>,
        <span style="color: #98be65;">"plots/dataset2.pdf"</span>

<span style="color: #51afef;">rule</span> <span style="color: #c678dd;">plot</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"raw/{dataset}.csv"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"plots/{dataset}.pdf"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"somecommand {input} {output}"</span>
</code></pre>
</div>
</section>
<section id="slide-org7e874be">
<h4 id="org7e874be">Snakemake R</h4>
<p>
Requires <code>rpy2</code>
</p>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">mapRNAseq</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #dcaeea;">file1</span> = <span style="color: #98be65;">"path/to/data/file1.bam"</span>,
        <span style="color: #dcaeea;">file2</span> = <span style="color: #98be65;">"path/to/data/file2.bam"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"path/to/qlf_table.csv"</span>
    <span style="color: #ECBE7B;">run</span>:
        R(<span style="color: #98be65;">"""</span>
<span style="color: #98be65;">        bamfiles &lt;- cbind({input.file1},{input.file2})</span>
<span style="color: #98be65;">        {output} &lt;- featureCounts(bamfiles, annot.inbuilt="hg19", strandspecific=2)</span>
<span style="color: #98be65;">        ...</span>
<span style="color: #98be65;">        ...</span>
<span style="color: #98be65;">        write.csv(qlf_table, file={output}, quote = FALSE)</span>
<span style="color: #98be65;">        """</span>)
</code></pre>
</div>
</section>
<section id="slide-org755985f">
<h4 id="org755985f">Snakemake R</h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">GM19_genes_edgeR</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"results/2019-02-28/GM19_gene_counts.rds"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"results/2019-03-25/GM19_rawdata_table.csv"</span>,
        <span style="color: #98be65;">"results/2019-03-25/GM19_genelen.csv"</span>,
        <span style="color: #98be65;">"results/2019-03-25/GM19_normalized.txt"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"../../envs/edgeR.yaml"</span>
    <span style="color: #ECBE7B;">threads</span>: <span style="color: #da8548; font-weight: bold;">4</span>
    <span style="color: #ECBE7B;">script</span>:
        <span style="color: #98be65;">"../../scripts/dge.R"</span>
</code></pre>
</div>
</section>
<section id="slide-org6ff2ef1">
<h4 id="org6ff2ef1">Test data</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>snakemake --use-conda --directory .test
</code></pre>
</div>
</section>
<section id="slide-org69e930d">
<h3 id="org69e930d">Organizing Bioinformatics Projects</h3>
<div class="outline-text-3" id="text-org69e930d">
</div>
</section>
<section id="slide-orgba90b84" data-background="img/org.png" data-background-size="1200px" data-background-transition="slide">
<h4 id="orgba90b84"></h4>
</section>
</section>
<section>
<section id="slide-org59c91e9">
<h2 id="org59c91e9">HPC Cluster</h2>
<div class="outline-text-2" id="text-org59c91e9">
</div>
</section>
<section id="slide-orgcb17456">
<h3 id="orgcb17456">Intro to Ganymede</h3>
<ul>
<li><code>ganymedeadmins@utdallas.edu</code></li>
<li>centos 7 with OpenHPC</li>
<li><a href="http://docs.oithpc.utdallas.edu">http://docs.oithpc.utdallas.edu</a></li>
<li>Access to <code>normal</code>, <code>debug</code>, <code>genomics</code>, and <code>GPU1</code> queue</li>

</ul>
</section>
<section id="slide-org39069ae">
<h3 id="org39069ae">Getting Access</h3>
<ul>
<li>Email <code>admin@ganymede</code> for access and to <b>genomics</b></li>
<li>Takes around a week</li>
<li>You can log in with <code>ssh &lt;NETID&gt;@ganymede.utdallas.edu</code></li>

</ul>
</section>
<section id="slide-org48d3c34">
<h3 id="org48d3c34">Some Basic Commands</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Info about slurm cluster</span>
sinfo
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">List enabled modules</span>
module list
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Available module</span>
module av
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Load anaconda</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Must be done everytime you log in</span>
module load anaconda3
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Cancel all jobs</span>
scancel -u &lt;NETID&gt;
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Check the queue</span>
squeue -p genomics
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Submit a job</span>
sbatch --help
</code></pre>
</div>
</section>
<section id="slide-org54192e9">
<h3 id="org54192e9">Installing Conda</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>pip install conda
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">If that doesn't work</span>
wget https://repo.anaconda.com/miniconda/Miniconda3-latest-Linux-x86_64.sh

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Make an environment</span>
conda create -n smk -c bioconda snakemake
conda install -c bioconda nextflow
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">OR</span>
conda create -n nf -c bioconda nextflow

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Activate your env</span>
conda activate smk
</code></pre>
</div>
</section>
