static/presentations/2019-05-07/index.org
** Running Things
1. Email ~admin@ganymede~ for access and to *genomics*
2. Setup local cookiecutter
3. Log in ~ssh eam150030@ganymede.utdallas.edu~
4. Load Modules
5. Rsync from local computer
#+begin_src shell
rsync -avtr /media/enhancer/IMR90/data eam150030@ganymede.utdallas.edu:/home/eam150030/IMR90/data
#+end_src
7. Activate conda env ~conda activate smk~
*** Running Things
Basic script
#+begin_src bash
#!/bin/bash
#SBATCH --ntasks=1
#SBATCH --time=00:10:00
#SBATCH --mail-user=eam150030@utdallas.edu
#SBATCH --mail-type=ALL

bowtie2 file.fastq
...
rysnc output back
#+end_src
** Snakemake on Slurm
1. Have ~snakemake~ installed
2. Make a cluster config file
#+begin_src json
{
    "__default__" :
    {
        "account" : "eam150030",
        "time" : "00:15:00",
        "n" : 1,
        "partition" : "genomics"
    },
    "compute1" :
    {
        "time" : "00:20:00"
    }
}
#+end_src
2. Use snakemake to submit jobs
#+begin_src bash
snakemake -j 999 --use-conda --cluster-config cluster.json \
    --cluster "sbatch -A {cluster.account} -p {cluster.partition}\
    -n {cluster.n}  -t {cluster.time}"
#+end_src
*** Slurm Script
#+begin_src bash
#!/bin/bash
#SBATCH --ntasks=1
#SBATCH --time=00:10:00
#SBATCH --mail-user=eam150030@utdallas.edu
#SBATCH --mail-type=ALL

conda activate smk

snakemake -j 999 --use-conda --cluster-config cluster.json \
    --cluster "sbatch -A {cluster.account} -p {cluster.partition}\
    -n {cluster.n}  -t {cluster.time}"

rsync -avtr results myLabComputer
#+end_src
** Nextflow
1. Have ~nextflow~ installed
2. Running a toy example
#+BEGIN_SRC shell
nextflow run rnatoy -with-singularity
#+END_SRC
 - Ganymede doesn't have docker so you can't use ~-with-docker~

3. Executing using slurm ([[https://www.nextflow.io/docs/latest/executor.html?highlight=slurm#slurm][docs]])
#+begin_src shell
# nextflow.config
process {
  executor = 'slurm'
  queue = 'genomics'
}
#+end_src
4. Run pipeline
#+begin_src shell
nextflow run tutorial.nf
nextflow -c nextflow.config run rnatoy -with-singularity
#+end_src

** PyTorch
#+begin_src python
from __future__ import print_function
import torch
torch.cuda.is_available()
x = torch.rand(5, 3)
print(x)
#+end_src
*** PyTorch Slurm Script
#+begin_src bash
#!/usr/bin/env bash
#SBATCH -J pytorchtest
#SBATCH -o pytorchtest-%A.out
#SBATCH -e pytorchtest-%A.err
#SBATCH -p GPU1
#SBATCH --gres=gpu:1
#SBATCH -c 1
#SBATCH -t 00:01:00
#SBATCH --mail-user=eam150030@utdallas.edu
#SBATCH --mail-type=ALL

module purge
module load singularity
module load CUDA
# Assuming that the container has been copied to the user's /scratch directory
singularity exec docker://pytorch/pytorch python \
    /home/eam150030/pytorch-demo/pytorch_example.py
#+end_src
* eRNA Prediction Pipeline from GRO-Seq INFB1 Induction Timecourse
** 
:PROPERTIES:
:reveal_background: img/globaltrans.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
** Overview
- Reproducing GM18
- Predicted IMR90 eRNAs
- Compared IMR90 Predicted Enhancers to GM
- Used Homer scripts to find DE of eRNAs and Genes
- Gene Centric vs. Enhancer Centric
** Reproducing GM18
- hg18 vs hg19
- Overpredicting eRNA transcripts
- Past Issue
  - What I thought Peng sent me
  - hg18 -> eRNAs -> Me
  - What actually happened
  - hg18 -> eRNAs -> LiftOver -> hg19 -> Me
- Main issue is homer uniqmap
*** 
:PROPERTIES:
:reveal_background: img/Figure_1.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** 
:PROPERTIES:
:reveal_background: img/Figure_2.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** 
:PROPERTIES:
:reveal_background: img/dag.png
:reveal_background_size: 400px
:reveal_background_trans: slide
:END:
*** Actual Pipelines
**** [[file:files/GM18dag.pdf][GM18]]
**** [[file:files/IMR19dag.pdf][IMR19]]
**** [[file:files/all.pdf][All]]
** Predicted IMR90 eRNAs
Changes from GM18
- hg19
- No liftover
** Compared IMR90 Predicted Enhancers to GM
*** 
:PROPERTIES:
:reveal_background: img/Venn.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:

** Used Homer scripts to find DE of eRNAs and Genes
** Gene Centric vs. Enhancer Centric
- Peng's approach
  - Took enhancers that were expressed deferentially
  - Linked them to Genes within 200Kb
- New approach
  - Take genes that are deferentially expressed
  - Link the Enhancers to those genes

*** 
:PROPERTIES:
:reveal_background: viz/pipeline.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** featureCounts
**** Tried CLI version
**** Couldn't get examples to work with edgeR
**** Switched to R package
*** edgeR
**** Error with exactTest
**** Defaulted to writing raw DGEList to file
**** Used in Pivot
*** Results
