static/presentations/2019-05-07/index.html
<section id="slide-org0ab7a73">
<h3 id="org0ab7a73">Running Things</h3>
<ol>
<li>Email <code>admin@ganymede</code> for access and to <b>genomics</b></li>
<li>Setup local cookiecutter</li>
<li>Log in <code>ssh eam150030@ganymede.utdallas.edu</code></li>
<li>Load Modules</li>
<li>Rsync from local computer</li>

</ol>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>rsync -avtr /media/enhancer/IMR90/data eam150030@ganymede.utdallas.edu:/home/eam150030/IMR90/data
</code></pre>
</div>
<ol>
<li>Activate conda env <code>conda activate smk</code></li>

</ol>
</section>
<section id="slide-org33f9d4c">
<h4 id="org33f9d4c">Running Things</h4>
<p>
Basic script
</p>
<div class="org-src-container">

<pre  class="src src-bash"><code trim><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">bash</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --ntasks=1</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --time=00:10:00</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-user=eam150030@utdallas.edu</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-type=ALL</span>

bowtie2 file.fastq
...
rysnc output back
</code></pre>
</div>
</section>
<section id="slide-org175747d">
<h3 id="org175747d">Snakemake on Slurm</h3>
<ol>
<li>Have <code>snakemake</code> installed</li>
<li>Make a cluster config file</li>

</ol>
<div class="org-src-container">

<pre  class="src src-json"><code trim>{
    <span style="color: #51afef;">"__default__"</span> :
    {
        <span style="color: #51afef;">"account"</span> : <span style="color: #98be65;">"eam150030"</span>,
        <span style="color: #51afef;">"time"</span> : "<span style="color: #da8548; font-weight: bold;">00</span>:<span style="color: #da8548; font-weight: bold;">15</span>:<span style="color: #da8548; font-weight: bold;">00</span>",
        <span style="color: #51afef;">"n"</span> : <span style="color: #da8548; font-weight: bold;">1</span>,
        <span style="color: #51afef;">"partition"</span> : <span style="color: #98be65;">"genomics"</span>
    },
    <span style="color: #51afef;">"compute1"</span> :
    {
        <span style="color: #51afef;">"time"</span> : "<span style="color: #da8548; font-weight: bold;">00</span>:<span style="color: #da8548; font-weight: bold;">20</span>:<span style="color: #da8548; font-weight: bold;">00</span>"
    }
}
</code></pre>
</div>
<ol>
<li>Use snakemake to submit jobs</li>

</ol>
<div class="org-src-container">

<pre  class="src src-bash"><code trim>snakemake -j <span style="color: #da8548; font-weight: bold;">999</span> --use-conda --cluster-config cluster.json <span style="color: #98be65;">\</span>
    --cluster <span style="color: #98be65;">"sbatch -A {cluster.account} -p {cluster.partition}\</span>
<span style="color: #98be65;">    -n {cluster.n}  -t {cluster.time}"</span>
</code></pre>
</div>
</section>
<section id="slide-org74ace69">
<h4 id="org74ace69">Slurm Script</h4>
<div class="org-src-container">

<pre  class="src src-bash"><code trim><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">bash</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --ntasks=1</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --time=00:10:00</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-user=eam150030@utdallas.edu</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-type=ALL</span>

conda activate smk

snakemake -j <span style="color: #da8548; font-weight: bold;">999</span> --use-conda --cluster-config cluster.json <span style="color: #98be65;">\</span>
    --cluster <span style="color: #98be65;">"sbatch -A {cluster.account} -p {cluster.partition}\</span>
<span style="color: #98be65;">    -n {cluster.n}  -t {cluster.time}"</span>

rsync -avtr results myLabComputer
</code></pre>
</div>
</section>
<section id="slide-org95b367c">
<h3 id="org95b367c">Nextflow</h3>
<ol>
<li>Have <code>nextflow</code> installed</li>
<li>Running a toy example</li>

</ol>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>nextflow run rnatoy -with-singularity
</code></pre>
</div>
<ul>
<li>Ganymede doesn&rsquo;t have docker so you can&rsquo;t use <code>-with-docker</code></li>

</ul>
<ol>
<li>Executing using slurm (<a href="https://www.nextflow.io/docs/latest/executor.html?highlight=slurm#slurm">docs</a>)</li>

</ol>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #5B6268;"># </span><span style="color: #5B6268;">nextflow.config</span>
process <span style="color: #51afef;">{</span>
  <span style="color: #dcaeea;">executor</span> = <span style="color: #98be65;">'slurm'</span>
  <span style="color: #dcaeea;">queue</span> = <span style="color: #98be65;">'genomics'</span>
<span style="color: #51afef;">}</span>
</code></pre>
</div>
<ol>
<li>Run pipeline</li>

</ol>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>nextflow run tutorial.nf
nextflow -c nextflow.config run rnatoy -with-singularity
</code></pre>
</div>

</section>
<section id="slide-org162958e">
<h3 id="org162958e">PyTorch</h3>
<div class="org-src-container">

<pre  class="src src-python"><code trim><span style="color: #51afef;">from</span> __future__ <span style="color: #51afef;">import</span> print_function
<span style="color: #51afef;">import</span> torch
torch.cuda.is_available()
<span style="color: #dcaeea;">x</span> = torch.rand(<span style="color: #da8548; font-weight: bold;">5</span>, <span style="color: #da8548; font-weight: bold;">3</span>)
<span style="color: #51afef;">print</span>(x)
</code></pre>
</div>
</section>
<section id="slide-org91a5a74">
<h4 id="org91a5a74">PyTorch Slurm Script</h4>
<div class="org-src-container">

<pre  class="src src-bash"><code trim><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #5B6268;"> bash</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -J pytorchtest</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -o pytorchtest-%A.out</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -e pytorchtest-%A.err</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -p GPU1</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --gres=gpu:1</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -c 1</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH -t 00:01:00</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-user=eam150030@utdallas.edu</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">SBATCH --mail-type=ALL</span>

module purge
module load singularity
module load CUDA
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Assuming that the container has been copied to the user's /scratch directory</span>
singularity exec docker://pytorch/pytorch python <span style="color: #98be65;">\</span>
    /home/eam150030/pytorch-demo/pytorch_example.py
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf7697ff">
<h2 id="orgf7697ff">eRNA Prediction Pipeline from GRO-Seq INFB1 Induction Timecourse</h2>
<div class="outline-text-2" id="text-orgf7697ff">
</div>
</section>
<section id="slide-org1133da9" data-background="img/globaltrans.png" data-background-size="800px" data-background-transition="slide">
<h3 id="org1133da9"></h3>
</section>
<section id="slide-org8ca133b">
<h3 id="org8ca133b">Overview</h3>
<ul>
<li>Reproducing GM18</li>
<li>Predicted IMR90 eRNAs</li>
<li>Compared IMR90 Predicted Enhancers to GM</li>
<li>Used Homer scripts to find DE of eRNAs and Genes</li>
<li>Gene Centric vs. Enhancer Centric</li>

</ul>
</section>
<section id="slide-org5bb4c22">
<h3 id="org5bb4c22">Reproducing GM18</h3>
<ul>
<li>hg18 vs hg19</li>
<li>Overpredicting eRNA transcripts</li>
<li>Past Issue
<ul>
<li>What I thought Peng sent me</li>
<li>hg18 -&gt; eRNAs -&gt; Me</li>
<li>What actually happened</li>
<li>hg18 -&gt; eRNAs -&gt; LiftOver -&gt; hg19 -&gt; Me</li>

</ul></li>
<li>Main issue is homer uniqmap</li>

</ul>
</section>
<section id="slide-orgabbd6e5" data-background="img/Figure_1.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orgabbd6e5"></h4>
</section>
<section id="slide-org3b11249" data-background="img/Figure_2.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org3b11249"></h4>
</section>
<section id="slide-org2be5b37" data-background="img/dag.png" data-background-size="400px" data-background-transition="slide">
<h4 id="org2be5b37"></h4>
</section>
<section id="slide-orgca817e0">
<h4 id="orgca817e0">Actual Pipelines</h4>
<div class="outline-text-4" id="text-orgca817e0">
</div>
<ul class="org-ul">
<li><a id="org225d975"></a><a href="files/GM18dag.pdf">GM18</a><br /></li>
<li><a id="orga704b25"></a><a href="files/IMR19dag.pdf">IMR19</a><br /></li>
<li><a id="org85b9a71"></a><a href="files/all.pdf">All</a><br /></li>
</ul>
</section>
<section id="slide-org5006b16">
<h3 id="org5006b16">Predicted IMR90 eRNAs</h3>
<p>
Changes from GM18
</p>
<ul>
<li>hg19</li>
<li>No liftover</li>

</ul>
</section>
<section id="slide-orgeb84bf6">
<h3 id="orgeb84bf6">Compared IMR90 Predicted Enhancers to GM</h3>
<div class="outline-text-3" id="text-orgeb84bf6">
</div>
</section>
<section id="slide-org20d3392" data-background="img/Venn.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org20d3392"></h4>

</section>
<section id="slide-orgeee07b9">
<h3 id="orgeee07b9">Used Homer scripts to find DE of eRNAs and Genes</h3>
</section>
<section id="slide-org62a7466">
<h3 id="org62a7466">Gene Centric vs. Enhancer Centric</h3>
<ul>
<li>Peng&rsquo;s approach
<ul>
<li>Took enhancers that were expressed deferentially</li>
<li>Linked them to Genes within 200Kb</li>

</ul></li>
<li>New approach
<ul>
<li>Take genes that are deferentially expressed</li>
<li>Link the Enhancers to those genes</li>

</ul></li>

</ul>

</section>
<section id="slide-org688a259" data-background="viz/pipeline.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org688a259"></h4>
</section>
<section id="slide-orgf8938d1">
<h4 id="orgf8938d1">featureCounts</h4>
<div class="outline-text-4" id="text-orgf8938d1">
</div>
<ul class="org-ul">
<li><a id="org2b92abc"></a>Tried CLI version<br /></li>
<li><a id="orgea03796"></a>Couldn&rsquo;t get examples to work with edgeR<br /></li>
<li><a id="org2eb8aa0"></a>Switched to R package<br /></li>
</ul>
</section>
<section id="slide-org586a94b">
<h4 id="org586a94b">edgeR</h4>
<div class="outline-text-4" id="text-org586a94b">
</div>
<ul class="org-ul">
<li><a id="org306ec8b"></a>Error with exactTest<br /></li>
<li><a id="org01bb7b6"></a>Defaulted to writing raw DGEList to file<br /></li>
